GodSpeeD-17/STM32F103C8T6_BareMetal/BareMetal/Driver/USART/Src/usart.c
/**
 * @file	usart.c
 * @author	Shrey Shah
 * @brief	USART Driver Implementation
 * @version	v2.0
 * @date	23-08-2026
 *
 * @details
 * @section USART_DRIVER_IMPL_SCOPE Scope
 * This source file implements the public USART driver API declared in
 * `usart.h`, for UART (asynchronous) mode only on `USART1`, `USART2`, and
 * `USART3`. The driver layer owns public validation, USART clock-state
 * verification, register-image reads, codec staging/extraction
 * orchestration, register-specific dirty-write decisions, and public
 * @ref driver_status_t handling.
 *
 * @section USART_DRIVER_IMPL_FIELD_OWNERSHIP Field Ownership
 * `USART_Config()` owns every domain represented by @ref usart_config_t:
 * `CR1.TE/RE` and `CR3.RTSE/CTSE` hardware enables, `CR1.M/PCE/PS` and
 * `CR2.STOP` frame format, and the `BRR` baud-rate divider. This source also
 * owns `CR1`/`CR3` interrupt-request sources and `SR` event
 * observation/acknowledgement. GPIO/AFIO pin configuration and its clock
 * gates are entirely application-owned, matching Timer PWM's GPIO ownership
 * model; this file never touches GPIO. The USART peripheral's own RCC clock
 * gate is likewise application-owned — every public entry point requires it
 * enabled beforehand and only verifies it through `_USART_ValidateClockEnabled()`.
 *
 * @section USART_DRIVER_IMPL_LAYOUT Source Layout
 * The public implementation follows the same banner and sub-banner order as
 * `usart.h`: operation state, root configuration, IRQ sources, then IRQ
 * events. Local helpers are kept ahead of the public functions and read as
 * orchestration over validation, codec staging, and the shared
 * `RegOps_WriteIfChanged()` dirty-write primitive.
 */

// ==================================================================================================== //
//												Includes												//
// ==================================================================================================== //
#include "usart.h"
#include "usart_codec.h"
#include "usart_ll.h"
#include "rcc.h"
#include "stm32f1xx_rcc.h"

// ==================================================================================================== //
//													Macros												//
// ==================================================================================================== //

/** @brief Timeout used while polling TXE/RXNE (~9ms @72MHz) @def USART_TRANSFER_TIMEOUT */
#define USART_TRANSFER_TIMEOUT							((uint32_t) 20000UL)

// ==================================================================================================== //
//										Local Validation Helpers										//
// ==================================================================================================== //

/**
 * @brief Validates a USART peripheral instance pointer
 * @param[in] USARTx USART peripheral instance
 * Accepted values:
 * - `USART1`
 * - `USART2`
 * - `USART3`
 * @returns @ref driver_status_t "USART-instance validation status"
 * @retval - @ref `DRIVER_STATUS_SUCCESS`: @p `USARTx` is supported
 * @retval - @ref `DRIVER_STATUS_ERROR_NULL_PTR`: @p `USARTx` is `NULL`
 * @retval - @ref `DRIVER_STATUS_ERROR_INVALID_ARG`: @p `USARTx` is unsupported
 */
__STATIC_FORCEINLINE driver_status_t _USART_ValidateInstance(const USART_TypeDef* const USARTx)
{
	//! Reject a null pointer before evaluating the supported-instance policy.
	if (USARTx == NULL)
	{
		return DRIVER_STATUS_ERROR_NULL_PTR;
	}

	if (USART_INSTANCE_IS_VALID(USARTx) != 0x00U)
	{
		return DRIVER_STATUS_SUCCESS;
	}
	else
	{
		return DRIVER_STATUS_ERROR_INVALID_ARG;
	}
}

/**
 * @brief Validates that a state selector is an accepted ON/OFF state
 * @param[in] state Driver state selector
 * @returns @ref driver_status_t "Binary-state validation status"
 * @retval - @ref `DRIVER_STATUS_SUCCESS`: @p `state` is accepted
 * @retval - @ref `DRIVER_STATUS_ERROR_INVALID_ARG`: @p `state` is not @ref `DRIVER_STATUS_OFF` or @ref `DRIVER_STATUS_ON`
 */
__STATIC_FORCEINLINE driver_status_t _USART_ValidateState(const driver_status_t state)
{
	//! Driver binary-state parameters accept only explicit OFF/ON states, never generic SUCCESS/ERROR states.
	if ((state != DRIVER_STATUS_OFF) && (state != DRIVER_STATUS_ON))
	{
		return DRIVER_STATUS_ERROR_INVALID_ARG;
	}

	return DRIVER_STATUS_SUCCESS;
}

/**
 * @brief Validates a non-empty USART interrupt-request source mask
 * @param[in] sources USART interrupt-request source bitmask to validate
 * @returns @ref driver_status_t "IRQ-source validation status"
 * @retval - @ref `DRIVER_STATUS_SUCCESS`: @p `sources` contains only supported, non-empty source bits
 * @retval - @ref `DRIVER_STATUS_ERROR_INVALID_ARG`: @p `sources` is empty or contains unsupported bits
 */
__STATIC_FORCEINLINE driver_status_t _USART_ValidateIRQSources(const usart_irq_source_t sources)
{
	//! Require at least one source and reject every bit outside the public CR1/CR3 vocabulary.
	if ((sources == USART_IRQ_SOURCE_NONE) || (USART_IRQ_SOURCE_IS_VALID(sources) == 0x00U))
	{
		return DRIVER_STATUS_ERROR_INVALID_ARG;
	}

	return DRIVER_STATUS_SUCCESS;
}

/**
 * @brief Validates a non-empty USART event-flag mask
 * @param[in] events USART event-flag bitmask to validate
 * @returns @ref driver_status_t "IRQ-event validation status"
 * @retval - @ref `DRIVER_STATUS_SUCCESS`: @p `events` contains only supported, non-empty event bits
 * @retval - @ref `DRIVER_STATUS_ERROR_INVALID_ARG`: @p `events` is empty or contains unsupported bits
 */
__STATIC_FORCEINLINE driver_status_t _USART_ValidateIRQEvents(const usart_event_flag_t events)
{
	//! Require at least one event and reject every bit outside the public SR vocabulary.
	if ((events == USART_IRQ_EVENT_NONE) || (USART_IRQ_EVENT_IS_VALID(events) == 0x00U))
	{
		return DRIVER_STATUS_ERROR_INVALID_ARG;
	}

	return DRIVER_STATUS_SUCCESS;
}

/**
 * @brief Decodes the RCC bus hosting one USART instance's peripheral clock
 * @param[in] USARTx USART peripheral instance
 * @param[out] pClockBus Destination for the decoded RCC bus selector
 * @returns @ref driver_status_t "Clock-bus decode status"
 * @retval - @ref `DRIVER_STATUS_SUCCESS`: @p `pClockBus` was published
 * @retval - @ref `DRIVER_STATUS_ERROR_NULL_PTR`: @p `pClockBus` is `NULL`
 * @retval - @ref `DRIVER_STATUS_ERROR_INVALID_ARG`: @p `USARTx` is unsupported
 * @note `USART1` hangs off APB2; `USART2`/`USART3` hang off APB1.
 * @pre Every call site validates @p `USARTx` before reaching this helper
 * (through `_USART_ValidateClockEnabled()` or an explicit instance check);
 * an invalid @p `USARTx` still safely falls through to the `default` case
 * below rather than being trusted blindly.
 */
__STATIC_FORCEINLINE driver_status_t _USART_DecodeClockBus(const USART_TypeDef* const USARTx, rcc_bus_t* const pClockBus)
{
	if (pClockBus == NULL)
	{
		return DRIVER_STATUS_ERROR_NULL_PTR;
	}

	//! Match by peripheral base address because instance macros are raw memory-mapped pointers.
	switch ((uintptr_t) USARTx)
	{
		case USART1_BASE_ADDRESS:
		{
			*pClockBus = RCC_APB2_BUS;
			break;
		}
		case USART2_BASE_ADDRESS:
		{
			*pClockBus = RCC_APB1_BUS;
			break;
		}
		case USART3_BASE_ADDRESS:
		{
			*pClockBus = RCC_APB1_BUS;
			break;
		}
		default:
		{
			return DRIVER_STATUS_ERROR_INVALID_ARG;
		}
	}

	return DRIVER_STATUS_SUCCESS;
}

/**
 * @brief Decodes the RCC peripheral clock-enable mask for one USART instance
 * @param[in] USARTx USART peripheral instance
 * @param[out] pClockEnableMask Destination for the decoded clock-enable mask
 * @returns @ref driver_status_t "Clock-enable-mask decode status"
 * @retval - @ref `DRIVER_STATUS_SUCCESS`: @p `pClockEnableMask` was published
 * @retval - @ref `DRIVER_STATUS_ERROR_NULL_PTR`: @p `pClockEnableMask` is `NULL`
 * @retval - @ref `DRIVER_STATUS_ERROR_INVALID_ARG`: @p `USARTx` is unsupported
 * @pre Every call site validates @p `USARTx` before reaching this helper
 * (through `_USART_ValidateClockEnabled()` or an explicit instance check);
 * an invalid @p `USARTx` still safely falls through to the `default` case
 * below rather than being trusted blindly.
 */
__STATIC_FORCEINLINE driver_status_t _USART_DecodeClockEnableMask(const USART_TypeDef* const USARTx, reg* const pClockEnableMask)
{
	if (pClockEnableMask == NULL)
	{
		return DRIVER_STATUS_ERROR_NULL_PTR;
	}

	//! Match by peripheral base address because instance macros are raw memory-mapped pointers.
	switch ((uintptr_t) USARTx)
	{
		case USART1_BASE_ADDRESS:
		{
			*pClockEnableMask = RCC_APB2ENR_USART1EN;
			break;
		}
		case USART2_BASE_ADDRESS:
		{
			*pClockEnableMask = RCC_APB1ENR_USART2EN;
			break;
		}
		case USART3_BASE_ADDRESS:
		{
			*pClockEnableMask = RCC_APB1ENR_USART3EN;
			break;
		}
		default:
		{
			return DRIVER_STATUS_ERROR_INVALID_ARG;
		}
	}

	return DRIVER_STATUS_SUCCESS;
}

/**
 * @brief Decodes the RCC peripheral reset mask for one USART instance
 * @param[in] USARTx USART peripheral instance
 * @param[out] pPeripheralResetMask Destination for the decoded reset mask
 * @returns @ref driver_status_t "Peripheral-reset-mask decode status"
 * @retval - @ref `DRIVER_STATUS_SUCCESS`: @p `pPeripheralResetMask` was published
 * @retval - @ref `DRIVER_STATUS_ERROR_NULL_PTR`: @p `pPeripheralResetMask` is `NULL`
 * @retval - @ref `DRIVER_STATUS_ERROR_INVALID_ARG`: @p `USARTx` is unsupported
 * @pre Every call site validates @p `USARTx` before reaching this helper
 * (through `_USART_ValidateClockEnabled()` or an explicit instance check);
 * an invalid @p `USARTx` still safely falls through to the `default` case
 * below rather than being trusted blindly.
 */
__STATIC_FORCEINLINE driver_status_t _USART_DecodePeripheralResetMask(const USART_TypeDef* const USARTx, reg* const pPeripheralResetMask)
{
	if (pPeripheralResetMask == NULL)
	{
		return DRIVER_STATUS_ERROR_NULL_PTR;
	}

	//! Match by peripheral base address so deconfiguration cannot pulse an unrelated peripheral reset.
	switch ((uintptr_t) USARTx)
	{
		case USART1_BASE_ADDRESS:
		{
			*pPeripheralResetMask = RCC_APB2RSTR_USART1RST;
			break;
		}
		case USART2_BASE_ADDRESS:
		{
			*pPeripheralResetMask = RCC_APB1RSTR_USART2RST;
			break;
		}
		case USART3_BASE_ADDRESS:
		{
			*pPeripheralResetMask = RCC_APB1RSTR_USART3RST;
			break;
		}
		default:
		{
			return DRIVER_STATUS_ERROR_INVALID_ARG;
		}
	}

	return DRIVER_STATUS_SUCCESS;
}

/**
 * @brief Validates that the USART peripheral's RCC clock gate is enabled
 * @param[in] USARTx USART peripheral instance
 * @returns @ref driver_status_t "Clock-gate validation status"
 * @retval - @ref `DRIVER_STATUS_SUCCESS`: The USART peripheral clock gate is enabled
 * @retval - @ref `DRIVER_STATUS_ERROR_NULL_PTR`: @p `USARTx` is `NULL`
 * @retval - @ref `DRIVER_STATUS_ERROR_INVALID_ARG`: @p `USARTx` is unsupported
 * @retval - @ref `DRIVER_STATUS_ERROR_STATE`: The USART peripheral clock gate is disabled
 * @note This helper never mutates the clock gate; enabling it remains an
 * exclusively application-owned action through RCC.
 */
__STATIC_FORCEINLINE driver_status_t _USART_ValidateClockEnabled(const USART_TypeDef* const USARTx)
{
	// Local Variables
	rcc_bus_t clockBus = RCC_APB1_BUS;
	reg clockEnableMask = 0x00000000UL;
	driver_status_t clockState = DRIVER_STATUS_ERROR;

