GodSpeeD-17/STM32F103C8T6_BareMetal/BareMetal/Driver/USART/Src/usart.c
	//! Validate the instance exactly once; the decode calls below trust it and skip re-validating.
	ASSERT_DRIVER_STATUS(_USART_ValidateInstance(USARTx));

	//! Decode the peripheral's RCC bus and clock-enable mask, then query the RCC directly for the gate state.
	ASSERT_DRIVER_STATUS(_USART_DecodeClockBus(USARTx, &clockBus));
	ASSERT_DRIVER_STATUS(_USART_DecodeClockEnableMask(USARTx, &clockEnableMask));

	//! Query RCC directly rather than caching state locally; the application exclusively owns this gate.
	clockState = RCC_GetPeripheralClockState(clockBus, clockEnableMask);
	if (clockState != DRIVER_STATUS_ERROR_INVALID_ARG)
	{
		if (clockState == DRIVER_STATUS_ON)
		{
			clockState = DRIVER_STATUS_SUCCESS;
		}
		else
		{
			clockState = DRIVER_STATUS_ERROR_STATE;
		}
	}

	return clockState;
}

// ==================================================================================================== //
//										Local Dirty-Write Helpers										//
// ==================================================================================================== //

/**
 * @brief Writes `USARTx_CR1` only when the staged image changed
 * @param[in] USARTx USART peripheral instance
 * @param[in] currentRegImage Current hardware `CR1` image
 * @param[in] stagedRegImage Staged `CR1` image
 * @returns @ref driver_status_t "CR1 dirty-write operation status"
 * @retval - @ref `DRIVER_STATUS_SUCCESS`: `CR1` write was skipped or performed
 * @retval - @ref `DRIVER_STATUS_ERROR_NULL_PTR`: @p `USARTx` is `NULL`
 * @retval - @ref `DRIVER_STATUS_ERROR_INVALID_ARG`: @p `USARTx` is unsupported
 */
__STATIC_FORCEINLINE driver_status_t _USART_WriteCR1IfChanged(USART_TypeDef* const USARTx, const reg currentRegImage, const reg stagedRegImage)
{
	ASSERT_DRIVER_STATUS(_USART_ValidateInstance(USARTx));
	return RegOps_WriteIfChanged(LL_USART_REG(USARTx, CR1), currentRegImage, stagedRegImage);
}

/**
 * @brief Writes `USARTx_CR2` only when the staged image changed
 * @param[in] USARTx USART peripheral instance
 * @param[in] currentRegImage Current hardware `CR2` image
 * @param[in] stagedRegImage Staged `CR2` image
 * @returns @ref driver_status_t "CR2 dirty-write operation status"
 * @retval - @ref `DRIVER_STATUS_SUCCESS`: `CR2` write was skipped or performed
 * @retval - @ref `DRIVER_STATUS_ERROR_NULL_PTR`: @p `USARTx` is `NULL`
 * @retval - @ref `DRIVER_STATUS_ERROR_INVALID_ARG`: @p `USARTx` is unsupported
 */
__STATIC_FORCEINLINE driver_status_t _USART_WriteCR2IfChanged(USART_TypeDef* const USARTx, const reg currentRegImage, const reg stagedRegImage)
{
	ASSERT_DRIVER_STATUS(_USART_ValidateInstance(USARTx));
	return RegOps_WriteIfChanged(LL_USART_REG(USARTx, CR2), currentRegImage, stagedRegImage);
}

/**
 * @brief Writes `USARTx_CR3` only when the staged image changed
 * @param[in] USARTx USART peripheral instance
 * @param[in] currentRegImage Current hardware `CR3` image
 * @param[in] stagedRegImage Staged `CR3` image
 * @returns @ref driver_status_t "CR3 dirty-write operation status"
 * @retval - @ref `DRIVER_STATUS_SUCCESS`: `CR3` write was skipped or performed
 * @retval - @ref `DRIVER_STATUS_ERROR_NULL_PTR`: @p `USARTx` is `NULL`
 * @retval - @ref `DRIVER_STATUS_ERROR_INVALID_ARG`: @p `USARTx` is unsupported
 */
__STATIC_FORCEINLINE driver_status_t _USART_WriteCR3IfChanged(USART_TypeDef* const USARTx, const reg currentRegImage, const reg stagedRegImage)
{
	ASSERT_DRIVER_STATUS(_USART_ValidateInstance(USARTx));
	return RegOps_WriteIfChanged(LL_USART_REG(USARTx, CR3), currentRegImage, stagedRegImage);
}

/**
 * @brief Writes `USARTx_BRR` only when the staged image changed
 * @param[in] USARTx USART peripheral instance
 * @param[in] currentRegImage Current hardware `BRR` image
 * @param[in] stagedRegImage Staged `BRR` image
 * @returns @ref driver_status_t "BRR dirty-write operation status"
 * @retval - @ref `DRIVER_STATUS_SUCCESS`: `BRR` write was skipped or performed
 * @retval - @ref `DRIVER_STATUS_ERROR_NULL_PTR`: @p `USARTx` is `NULL`
 * @retval - @ref `DRIVER_STATUS_ERROR_INVALID_ARG`: @p `USARTx` is unsupported
 */
__STATIC_FORCEINLINE driver_status_t _USART_WriteBRRIfChanged(USART_TypeDef* const USARTx, const reg currentRegImage, const reg stagedRegImage)
{
	ASSERT_DRIVER_STATUS(_USART_ValidateInstance(USARTx));
	return RegOps_WriteIfChanged(LL_USART_REG(USARTx, BRR), currentRegImage, stagedRegImage);
}

// ==================================================================================================== //
// USART Operation State APIs
// ==================================================================================================== //

driver_status_t USART_GetOperationState(const USART_TypeDef* const USARTx)
{
	//! Operation state is CR1.UE; the USART clock gate must be enabled before CR1 can be read.
	ASSERT_DRIVER_STATUS(_USART_ValidateClockEnabled(USARTx));
	return Codec_USART_ExtractOperationState(LL_USART_ReadCR1(USARTx));
}

driver_status_t USART_SetOperationState(USART_TypeDef* const USARTx, const driver_status_t operationState)
{
	// Local Variables
	reg currentCr1RegImage = 0x00000000UL;
	reg stagedCr1RegImage = 0x00000000UL;

	//! Operation state owns only CR1.UE; it refuses to touch CR1 while the USART clock gate is off.
	ASSERT_DRIVER_STATUS(_USART_ValidateClockEnabled(USARTx));
	ASSERT_DRIVER_STATUS(_USART_ValidateState(operationState));

	//! Snapshot CR1 once and stage only UE while preserving every unrelated field.
	currentCr1RegImage = LL_USART_ReadCR1(USARTx);
	stagedCr1RegImage = currentCr1RegImage;
	ASSERT_DRIVER_STATUS(Codec_USART_StageOperationState(&stagedCr1RegImage, operationState));

	//! Commit CR1 only when UE changed.
	return _USART_WriteCR1IfChanged(USARTx, currentCr1RegImage, stagedCr1RegImage);
}

// ==================================================================================================== //
// USART Configuration APIs
// ==================================================================================================== //

driver_status_t USART_DeConfig(USART_TypeDef* const USARTx)
{
	// Local Variable
	reg peripheralResetMask = 0x00000000UL;
	rcc_bus_t clockBus = RCC_APB1_BUS;

	//! Require explicit application clock ownership before resetting the USART register bank.
	ASSERT_DRIVER_STATUS(_USART_ValidateClockEnabled(USARTx));
	ASSERT_DRIVER_STATUS(_USART_DecodeClockBus(USARTx, &clockBus));
	ASSERT_DRIVER_STATUS(_USART_DecodePeripheralResetMask(USARTx, &peripheralResetMask));

	//! Reset only USART-owned peripheral state; RCC clock gating and NVIC delivery remain unchanged.
	return RCC_PulsePeripheralReset(clockBus, peripheralResetMask);
}

driver_status_t USART_Config(USART_TypeDef* const USARTx, const usart_config_t* const pConfig)
{
	// Local Variables
	rcc_bus_t clockBus = RCC_APB1_BUS;
	frequency_t busFrequency = FREQ_ZERO;
	reg currentCr1RegImage = 0x00000000UL;
	reg targetCr1RegImage = 0x00000000UL;
	reg currentCr2RegImage = 0x00000000UL;
	reg targetCr2RegImage = 0x00000000UL;
	reg currentCr3RegImage = 0x00000000UL;
	reg targetCr3RegImage = 0x00000000UL;
	reg currentBrrRegImage = 0x00000000UL;
	reg targetBrrRegImage = 0x00000000UL;

