GodSpeeD-17/STM32F103C8T6_BareMetal/BareMetal/Driver/USART/Src/usart.c
	//! Validate the complete root request and require the application-owned clock gate.
	if (pConfig == NULL)
	{
		return DRIVER_STATUS_ERROR_NULL_PTR;
	}
	ASSERT_DRIVER_STATUS(_USART_ValidateClockEnabled(USARTx));

	//! Snapshot every register the root transaction can touch, exactly once each.
	currentCr1RegImage = LL_USART_ReadCR1(USARTx);
	targetCr1RegImage = currentCr1RegImage;
	currentCr2RegImage = LL_USART_ReadCR2(USARTx);
	targetCr2RegImage = currentCr2RegImage;
	currentCr3RegImage = LL_USART_ReadCR3(USARTx);
	targetCr3RegImage = currentCr3RegImage;
	currentBrrRegImage = LL_USART_ReadBRR(USARTx);
	targetBrrRegImage = currentBrrRegImage;

	//! Stage the hardware-enable and frame-format domains into their owning local images.
	ASSERT_DRIVER_STATUS(Codec_USART_StageHardwareEnableState(&targetCr1RegImage, &targetCr3RegImage, pConfig->hardware));
	ASSERT_DRIVER_STATUS(Codec_USART_StageDataConfig(&targetCr1RegImage, &targetCr2RegImage, &(pConfig->frameFormat)));

	//! Resolve the live bus frequency this instance's BRR divider must be computed against.
	ASSERT_DRIVER_STATUS(_USART_DecodeClockBus(USARTx, &clockBus));
	busFrequency = RCC_GetBusFrequency(clockBus);
	if (busFrequency == FREQ_ZERO)
	{
		return DRIVER_STATUS_ERROR_STATE;
	}
	ASSERT_DRIVER_STATUS(Codec_USART_StageBaudRate(&targetBrrRegImage, busFrequency, pConfig->baudRate));

	//! Dirty-write each changed register exactly once; unrelated fields outside each domain are preserved.
	ASSERT_DRIVER_STATUS(_USART_WriteCR1IfChanged(USARTx, currentCr1RegImage, targetCr1RegImage));
	ASSERT_DRIVER_STATUS(_USART_WriteCR2IfChanged(USARTx, currentCr2RegImage, targetCr2RegImage));
	ASSERT_DRIVER_STATUS(_USART_WriteCR3IfChanged(USARTx, currentCr3RegImage, targetCr3RegImage));
	ASSERT_DRIVER_STATUS(_USART_WriteBRRIfChanged(USARTx, currentBrrRegImage, targetBrrRegImage));

	return DRIVER_STATUS_SUCCESS;
}

// ==================================================================================================== //
// USART Data Transfer APIs
// ==================================================================================================== //

driver_status_t USART_ReceiveByte(const USART_TypeDef* const USARTx, uint8_t* const pByte)
{
	// Local Variables
	usart_event_flag_t	pendingEvents = USART_IRQ_EVENT_NONE;
	volatile uint32_t	timeout = USART_TRANSFER_TIMEOUT;

	// Validate Input
	if (pByte == NULL)
	{
		return DRIVER_STATUS_ERROR_NULL_PTR;
	}
	//! Data transfer requires the same clock-gate precondition as every other register-touching API.
	ASSERT_DRIVER_STATUS(_USART_ValidateClockEnabled(USARTx));

	//! Bound the RXNE spin-wait: a silent peer would otherwise hang this call forever.
	while (timeout > 0x00UL)
	{
		//! Extract Status Register Events
		ASSERT_DRIVER_STATUS(Codec_USART_ExtractIRQEvents(LL_USART_ReadSR(USARTx), &pendingEvents));
		//! Check for Receive-Data-Register-Not-Empty (RXNE) 
		if ((pendingEvents & USART_IRQ_EVENT_RXNE) != USART_IRQ_EVENT_NONE)
		{
			//! Read the Data Register
			*pByte = (uint8_t) LL_USART_ReadDR(USARTx);
			//! Return Status
			return DRIVER_STATUS_SUCCESS;
		}
		//! Decrement the bounded spin-wait counter
		timeout--;
	}

	//! Return a timeout error if RXNE never became set within the bounded poll window
	return DRIVER_STATUS_ERROR_TIMEOUT;
}

driver_status_t USART_TransmitByte(USART_TypeDef* const USARTx, const uint8_t byte)
{
	// Local Variables
	usart_event_flag_t	pendingEvents = USART_IRQ_EVENT_NONE;
	volatile uint32_t	timeout = USART_TRANSFER_TIMEOUT;

	//! Data transfer requires the same clock-gate precondition as every other register-touching API.
	ASSERT_DRIVER_STATUS(_USART_ValidateClockEnabled(USARTx));

	//! Bound the TXE spin-wait so a wedged transmitter cannot hang this call forever.
	while (timeout > 0x00UL)
	{
		//! Extract Status Register Events
		ASSERT_DRIVER_STATUS(Codec_USART_ExtractIRQEvents(LL_USART_ReadSR(USARTx), &pendingEvents));
		//! Check for Transmit-Data-Register-Empty (TXE)
		if ((pendingEvents & USART_IRQ_EVENT_TXE) != USART_IRQ_EVENT_NONE)
		{
			//! Write the Data Register
			LL_USART_WriteDR(USARTx, (reg) byte);
			//! Return Status
			return DRIVER_STATUS_SUCCESS;
		}
		//! Decrement the bounded spin-wait counter
		timeout--;
	}

	//! Return a timeout error if TXE never became set within the bounded poll window
	return DRIVER_STATUS_ERROR_TIMEOUT;
}

// ==================================================================================================== //
// USART IRQ Source APIs
// ==================================================================================================== //

driver_status_t USART_GetIRQSources(const USART_TypeDef* const USARTx, usart_irq_source_t* const pSources)
{
	//! Validate destination storage before reading the peripheral interrupt-enable registers.
	if (pSources == NULL)
	{
		return DRIVER_STATUS_ERROR_NULL_PTR;
	}
	//! Sources span CR1 and CR3; the clock gate must be enabled before either can be read.
	ASSERT_DRIVER_STATUS(_USART_ValidateClockEnabled(USARTx));
	return Codec_USART_ExtractIRQSources(LL_USART_ReadCR1(USARTx), LL_USART_ReadCR3(USARTx), pSources);
}

driver_status_t USART_SetIRQSources
(
	USART_TypeDef* const		USARTx,
	const usart_irq_source_t	sources,
	const driver_status_t		sourceState
)
{
	// Local Variables
	reg currentCr1RegImage = 0x00000000UL;
	reg targetCr1RegImage = 0x00000000UL;
	reg currentCr3RegImage = 0x00000000UL;
	reg targetCr3RegImage = 0x00000000UL;

	//! Validate the instance, source mask, and state before reading or staging CR1/CR3.
	ASSERT_DRIVER_STATUS(_USART_ValidateInstance(USARTx));
	ASSERT_DRIVER_STATUS(_USART_ValidateIRQSources(sources));
	ASSERT_DRIVER_STATUS(_USART_ValidateState(sourceState));
	ASSERT_DRIVER_STATUS(_USART_ValidateClockEnabled(USARTx));

	//! Snapshot both registers once and stage only the selected sources.
	currentCr1RegImage = LL_USART_ReadCR1(USARTx);
	targetCr1RegImage = currentCr1RegImage;
	currentCr3RegImage = LL_USART_ReadCR3(USARTx);
	targetCr3RegImage = currentCr3RegImage;
	ASSERT_DRIVER_STATUS(Codec_USART_StageIRQSources(&targetCr1RegImage, &targetCr3RegImage, sources, sourceState));

	//! Commit each register only when the selected sources actually changed its image.
	ASSERT_DRIVER_STATUS(_USART_WriteCR1IfChanged(USARTx, currentCr1RegImage, targetCr1RegImage));
	ASSERT_DRIVER_STATUS(_USART_WriteCR3IfChanged(USARTx, currentCr3RegImage, targetCr3RegImage));

	return DRIVER_STATUS_SUCCESS;
}

// ==================================================================================================== //
// USART IRQ Event APIs
// ==================================================================================================== //

driver_status_t USART_GetIRQEvents(const USART_TypeDef* const USARTx, usart_event_flag_t* const pEvents)
{
	//! Validate destination storage before reading the USART status register.
	if (pEvents == NULL)
	{
		return DRIVER_STATUS_ERROR_NULL_PTR;
	}
	//! ISR-path instance check only: clock-enabled state was already proven by USART_Config()/SetIRQSources() and cannot change while this interrupt source is still live.
	ASSERT_DRIVER_STATUS(_USART_ValidateInstance(USARTx));
	return Codec_USART_ExtractIRQEvents(LL_USART_ReadSR(USARTx), pEvents);
}

driver_status_t USART_AckIRQEvents(USART_TypeDef* const USARTx, const usart_event_flag_t events)
{
	// Local Variables
	reg srRegImage = (reg) USART_IRQ_EVENT_ALL;

	//! ISR-path instance check only: clock-enabled state was already proven by USART_Config()/SetIRQSources() and cannot change while this interrupt source is still live.
	ASSERT_DRIVER_STATUS(_USART_ValidateInstance(USARTx));
	ASSERT_DRIVER_STATUS(_USART_ValidateIRQEvents(events));

	//! Never re-read SR here: a second read could latch a newer event than the one the caller observed via USART_GetIRQEvents(), silently discarding it on the DR read below.
	//! Starting from all-1s is a safe no-op for every bit except the TC/CTS bits the codec clears explicitly.
	ASSERT_DRIVER_STATUS(Codec_USART_StageIRQEventsClear(&srRegImage, events));
	//! Unconditional write: SR is write-0-to-clear for TC/CTS, so re-writing an unchanged image is harmless.
	LL_USART_WriteSR(USARTx, srRegImage);

	//! Complete the read-SR-then-read-DR sequence for the remaining flags; this discards the buffered DR value.
	if ((events & USART_IRQ_EVENT_READ_SEQUENCE) != USART_IRQ_EVENT_NONE)
	{
		(void) LL_USART_ReadDR(USARTx);
	}

	return DRIVER_STATUS_SUCCESS;
}
